TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/examples/eqep/eqep_ex5_speed_dir_motor.syscfg

/**
 * Import the modules used in this configuration.
 */
 const eqep  = scripting.addModule("/driverlib/eqep.js", {}, false);
 const eqep1 = eqep.addInstance();
 
 /**
  * Write custom configuration values to the imported modules.
  */
 eqep1.$name                = "myEQEP0";
 eqep1.registerInterrupts   = true;
 eqep1.enableInterrupt      = true;
 eqep1.interruptSources     = ["EQEP_INT_UNIT_TIME_OUT"];
 eqep1.eqepResolution       = "EQEP_CONFIG_1X_RESOLUTION";
 eqep1.emulationMode        = "EQEP_EMULATIONMODE_RUNFREE";
 eqep1.positionCounterMax   = 4294967295;
 eqep1.enableUnitTimer      = true;
eqep1.unitTimerPeriod      = 1500000;
 eqep1.latchPositionCounter = "EQEP_LATCH_UNIT_TIME_OUT";
 eqep1.swPositionInit       = true;
 eqep1.enableModule         = true;
 eqep1.eqep.$assign         = "EQEP1";
eqep1.eqep.eqep_aPin.$assign     = "A17, B17, C17, GPIO20";
eqep1.eqep.eqep_bPin.$assign     = "A18, B18, C18, GPIO21";
eqep1.eqepInt.enableInterrupt = true;
  